{"meta":{"title":"Barnyak","subtitle":"Video Games and Space News","description":"Video Games and Space News.  A collection of interesting things, reviews and my take on techish news.","author":"Justin Barnyak","url":"https://barnyak.com","root":"/"},"pages":[{"title":"search","date":"2020-08-31T21:27:36.320Z","updated":"2020-08-31T21:27:36.320Z","comments":true,"path":"search/index.html","permalink":"https://barnyak.com/search/index.html","excerpt":"","text":""},{"title":"About","date":"2020-08-31T22:01:10.050Z","updated":"2020-08-31T22:01:10.050Z","comments":true,"path":"about/index.html","permalink":"https://barnyak.com/about/index.html","excerpt":"","text":"I (on the left) write about video games and space. Not much else to say. If you need something just reach out to me by email"},{"title":"radar","date":"2020-09-16T04:09:44.000Z","updated":"2020-09-18T18:54:35.980Z","comments":true,"path":"radar/index.html","permalink":"https://barnyak.com/radar/index.html","excerpt":"","text":"The Radar A collection of various things from the internet I find interesting."}],"posts":[{"title":"Outward The Three Brothers","slug":"outward_dlc2","date":"2020-10-28T04:00:00.000Z","updated":"2020-10-29T04:07:37.260Z","comments":true,"path":"2020/outward_dlc2/","link":"","permalink":"https://barnyak.com/2020/outward_dlc2/","excerpt":"","text":"Topic: Outward The second Outward DLC, “The Three Brothers,” is slated for a December release this year. Nine Dots gives us access to a new area, “Caldera,” flaunting an array of new content. We should see new weapons, skills, and stories, as well as a new City building mechanic. It’s unclear how involved the mechanic is. But it’s safe to assume we’re going to see a standard slot based town upgrade system. Along with upgrades to NPCs? We might even see some tasks or missions to send guards or merchants out on if we’re lucky! The new skill tree is called “Grenades,” but we don’t know much beyond that yet. Outward is a solid co-op action RPG in a world of indie titles often lacking the depth to hit that AAA sweet spot. Outward delivers reasonably well in this department. From The Publisher City Building Mechanic: Rebuilding SiroccoCreate your own landmark in Aurai by helping the population to survive in this ruthless world! With the new City Building mechanic, you are part of rebuilding the Refugee Camp into New Sirocco. New Area: CalderaAurai is expanding and Caldera is more than just a new landscape. New dungeons, quests and locations make it a treasure trove for every adventurer! New Skills, Weapons and many moreOne new skill tree, Grenades and numerous possibilities to enchant your weapons, give you the tools to be more creative when it comes to the fight for survival! Forge your own unique combat style!","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Baldurs Gate 3 Evolving Review","slug":"baldursgate3","date":"2020-10-06T04:00:00.000Z","updated":"2020-10-29T03:51:14.580Z","comments":true,"path":"2020/baldursgate3/","link":"","permalink":"https://barnyak.com/2020/baldursgate3/","excerpt":"","text":"Topic: Baldurs Gate 3 Baldurs Gate 3 is finally upon us! Grab your sword, axe, staff, or bow and get ready to dive into another thousand-hour adventure! Let’s start by setting some expectations; it is in early-access. So expect a few hiccups, strange occurrences, and straight-up bugs around the way. For those of you not in the know, Baldurs Gate 3 is the spiritual successor to Divinity Original Sin 2. A turn-based (but only when you’re in combat or sneaking around) RPG that prides itself on immersive characters and deep story. I consider it the gold standard for co-op RPG games. The classes are diverse and well thought out but are all immediately recognizable. Exploring is exciting and full of unexpected twists and turns. Combat is challenging and very satisfying when you finally clean the house. I’m going to do something new for this title. Instead of playing through it and writing a formal review, I’m just going to update this every couple of sessions, as evolving feedback of my thoughts and feelings. Sessions10/7/2020 - Getting Started Last night was my first session with the title since it went into early access. I have a warrior drow (but dexterity and bow focused), and we’re planning on doing an “evil” campaign. It’s been a blast. Sure there’s been some superficial bugs I’m sure you’ve already heard about elsewhere. But nothing beyond minor annoyances and things being a bit odd. The face-scans make all the characters look crazy good. But they do seem a bit repetitive. Combat is fantastic, as expected. The Divinity 4 engine is gorgeous. The increased camera controls and freedom allow you to sit there and appreciate the scenes to a higher degree. The UI is more polished and frankly looks nicer. It’s a good, fun, classic RPG excitement. The next session can’t come sooner!!","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Always Home Cam is the Future of Home Automation","slug":"alwayshomecam","date":"2020-09-28T04:00:00.000Z","updated":"2020-10-29T03:51:14.580Z","comments":true,"path":"2020/alwayshomecam/","link":"","permalink":"https://barnyak.com/2020/alwayshomecam/","excerpt":"","text":"Topic: Always Home Cam The recently announced Always Home Cam is a giant leap in technical achievement and cultural paradigm surrounding home automation. Until recently, the home automation market has focused on extending your phone’s utility to dedicated spaces in your home. Home automation products integrate seamlessly with your phone and other devices to attempt a digital immersion of your home. The new Always Home Cam is the next generation of true home automation. The Always Home Cam is essentially a small, blade protected, compact drone with a camera, speaker, and microphone attached. It can automatically find it’s dock when battery levels get low, with no other important limitation on how far it can travel. The ability to move from room to room fundamentally extends every single other home automation feature into a real “digital butler” experience. The platforms we could create with drones like this opens the door for infinite activities. You could have it do anything from playing music for you as you clean your house or monitoring the perimeter while you’re gone on vacation. Once the proverbial cat is out of the bag regarding interior robotics (while floor and wall cleaning robots exist, they lack the total freedom and camera/mic input combination), the market is going to go crazy. With this fundamental platform the possibilities of add-on products are endless. The idea of a realized robotic butler is no longer science fiction. This statement alone should send your heart racing.","categories":[{"name":"tech","slug":"tech","permalink":"https://barnyak.com/categories/tech/"}],"tags":[]},{"title":"We Were Here Together Review","slug":"wewereheretogether","date":"2020-09-25T04:00:00.000Z","updated":"2020-09-25T23:06:35.900Z","comments":true,"path":"2020/wewereheretogether/","link":"","permalink":"https://barnyak.com/2020/wewereheretogether/","excerpt":"","text":"Topic: We Were Here Together I stumbled upon We Were Here Together on steam without having played any first-person puzzle games before. The steam page portrays it as a two-person puzzle adventure game, where you roamed around a “Castle Rock” in first-person solving a myriad of challenges. Aesthetically it was clean, polished, and felt timeless to a degree. The cold, crisp blue snowing exterior initially left me curious about the tone of the game. Still, as I scroll, the warm orange interiors of what appeared to be a haunted mansion brought back a sense of adventure that immediately grabbed my attention. At this point, it’s fair to say I was put off by it being a dedicated puzzle game as this isn’t my typical choice of degree. But believe me, I’m delighted I did. You open in an antarctic outpost where your fellow explorers appear to be missing. Eerie music leaves you a bit on edge. The entire setting makes you unsure of what direction the game is going to take. The story, pacing, and mechanics are all still a mystery. A lone radio signal crackles, Someone is in distress. Nothing but this peculiar cabin and surrounding frozen wasteland stand in the way of you responding to the foreboding call for help. The controls feel good; I never thought it necessary to look up a particular mapping or was frustrated when interacting with something. There is an inventory system, but it’s light and straightforward, which perfectly fits the puzzle mechanics. A sense of community is the essence of taking even a fantastic experience and bringing it to this high immersion level that makes video games such a unique experience. Developers have a history of knowing this and, in an attempt to capture it, often force a player to perform social interactions. A crappy stand on two pressure plates to open the door puzzle in the middle of an otherwise excellent dungeon always leaves me with a sense of pandering. We Were Here Together is none of these. It’s fundamentally designed from the ground up not only to require you to work together, but to make you want to work together. It’s not that you couldn’t play this on your own; it’s captured better by recognizing the game is better with a good friend. As you depart the Outpost and work your way towards the Keep We Were Here Together, nails every tone it sets out to capture. The puzzles built on each other regarding the communication skills it was steering you towards, and it still had a perfect balance of diversity and curiosity for what challenges lay ahead. There was a masterstroke in balancing when it came to how much you actively needed to work out yourself and what required you to communicate with your partner to solve—often allowing you to work out 90% of the puzzle but still requiring critical information from your partner. While simultaneously having an alternative mirrored version of the same challenge for your partner solve. This symmetry prevented one person from falling behind or getting ahead in their progression. I had a wholesome, almost emotional sense of accomplishment for most of the puzzles that I didn’t expect. Everything they managed to pack into a perfectly paced 5-hour session left me with no suggestions or wishful thinking in what the game could have been. In SummaryEven if you don’t usually play puzzle games, I’d recommend this wholeheartedly. Do yourself a favor and give it a play.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Overwatch Elevator Update","slug":"elevators","date":"2020-09-25T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/elevators/","link":"","permalink":"https://barnyak.com/2020/elevators/","excerpt":"","text":"Topic: Overwatch Overwatch elevators got a much-needed rework on the PTR! Instead of being on a constant loop, the various moving platforms have a new behavior: Wait at the bottom of their loop for a player to get on After a short delay, it rapidly moves up to the top After a brief pause, it then goes back down This movement now makes a noticeable sound effect, effectively giving away your position.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Ghostrunner Demo Announced","slug":"ghostrunnerdemo","date":"2020-09-23T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/ghostrunnerdemo/","link":"","permalink":"https://barnyak.com/2020/ghostrunnerdemo/","excerpt":"","text":"Topic: Ghostrunner I’ve talked about Ghostrunner before. Please go check it out for more info. Today I bring you news about an upcoming Demo for Ghostrunner, however. Releasing October 27th (But a demo going live on September 29th on steam).There’s also a new trailer and some pre-order info. The most massive pre-order discounts are landing over at steam with 20% and Xbox one trailing at 10%. We’ve only got about a month to wait at this point! Hopefully, the demo will help scratch the cyberpunk itch to get over that last hump. It’s finally happening, people!","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"EVE Online Project Discovery","slug":"esocovid","date":"2020-09-22T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/esocovid/","link":"","permalink":"https://barnyak.com/2020/esocovid/","excerpt":"","text":"Topic: EVE Online Phase 3 of the EVE online Project Discovery event was announced today. Project Discovery is an in-game mini-game that collects real scientific data on flow cytometry and cell populations. Most notably, it’s been helping understand COVID-19 more. Since it’s launch, the project has contributed. Of those, 466,000 “verified and now able to be used in scientific research.” More MMO’s should be implementing these platforms tying in what is often just filler or meaningless breaks in the core mechanics you could be contributing invaluable data, especially in our current pandemic. It’s contributing real, valuable information for us as a species. It’s fantastic on so many levels.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"New OPAL Jupiter Images","slug":"opal","date":"2020-09-18T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/opal/","link":"","permalink":"https://barnyak.com/2020/opal/","excerpt":"","text":"Topic: JupiterCredit: NASA You’re looking at them! NASA released new Hubble shots of Jupiter on August 25th. These are crystal clear and give us a really cool insight into Jupiter’s upcoming weather forecast. Unfortunately, Jupiter’s red spot is still shrinking. It’s gotten to about 9,800 miles across. In the realm of good news, however, Red Spot Jr’s has halted it’s fade back to white and appears to be darkening again. We may yet get our twin red storms of fantasy! I’m not sure if this at the start or tail end of our yearly OPAL missions. But we will hopefully still get some more shots before we have to wait yet another year. The ongoing shrinkage of Jupiter’s red spot is still a “mystery”.Credit: NASA","categories":[{"name":"space","slug":"space","permalink":"https://barnyak.com/categories/space/"}],"tags":[]},{"title":"Ghostrunner","slug":"ghostrunner","date":"2020-09-15T04:00:00.000Z","updated":"2020-09-16T04:08:09.860Z","comments":true,"path":"2020/ghostrunner/","link":"","permalink":"https://barnyak.com/2020/ghostrunner/","excerpt":"","text":"Topic: Ghostrunner Holy shit Ghostrunner looks really damn good. Cyberpunk parkour says everything it needs to. It’s got it all: Cyberpunk textures, cyberpunk animations, cyberpunk music. If you want anything more, frankly, you’re just greedy. Releasing October 27th (But a demo going live on Sep 29th on steam). Did I mention RTX Ray Tracing? I feel like I get another jolt of excitement every time I hear a new aspect of Ghostrunner. The immersion of those cyber punk beats as this bad ass cyber samurai slashes from enemy to enemy puts me over the top. If One More Level knocks this out of the park i’ll probably try out God’s Trigger as well. Enough with my ramblings, here’s what the publisher actually has to say. Description From the publisherA cataclysm has wiped out most of humanity and destroyed the environment. Now, when resources are scarce, the survivors live in a tower built by long-forgotten hands. But the structure is torn by violence, poverty, and chaos. A person’s worth depends on the category of implants they have, defining their whole lives. It’s no surprise that a rebellion starts. You are a cyber-warrior, a living weapon, the only one capable of fighting both in the physical world and in cyberspace. Lost and hunted, thrown into the middle of the conflict, you must use this bond with technology to ascend the tower. Features From the publisher Ascend the tower – use the environment to your advantage and face fast and determined enemies. Act fast - armed with a melee weapon, get to the enemies before they have a chance to shoot. You are a cyber-warrior – fight both in the physical world and in cyberspace. Choose your own strategy – use your special abilities to avoid bullets and eliminate enemies: the dynamic movement system turns combat into a true dance of death. Trial and error – you die from one hit, so learn the levels by heart and adapt. Next-gen visuals – Ghostrunner aims to bring the visuals of a blockbuster title to a more condensed indie action experience.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Venus Atmosphere Findings","slug":"venusphosphine","date":"2020-09-14T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/venusphosphine/","link":"","permalink":"https://barnyak.com/2020/venusphosphine/","excerpt":"","text":"Topic: AstrobiologySub-Topic: VenusCredit: NASA Recently some analysis was done on the findings of the JCMT and ALMA telescopes that provides evidence with “no other plausible identification” that phosphine gas is present in Venus’s Atmosphere. With the current understanding of Venus it would be expected that phosphine would be in an oxidized form but apparently this isn’t the case. This leaves us with a heart-pounding conclusion to draw, live might be or have been on Venus. And if it can survive there… then so can we. This is a big deal in the realm of Astrobiology. The main-stream best contender for life up till now was Mars. And the academic backing behind that was primarily because of the methane gas in it’s atmosphere. However methane is more easily explainable away (Geological activity, which we now know was there int he past). It’s important to not gloss over the fact that Mars having geological activity and methane is a big deal. And could still serve as evidence of potential life. But it’s not as strong an indicator as phosphine gas. Credit: NASA For me this brings flash backs to the fantastical venus sky cities I read about in a BBC future article (Found it). Not that we’ve been in a lull of physics and astronomy news. But this is just more fuel to the flame of colonization of our solar system. I can only help it happens sooner rather then latter. Related Journal - nature astronomy","categories":[{"name":"space","slug":"space","permalink":"https://barnyak.com/categories/space/"}],"tags":[]},{"title":"Tony Hawk Nostalgia Skater 1+2","slug":"tonyhawkproskater12","date":"2020-09-11T04:00:00.000Z","updated":"2020-09-11T21:07:59.370Z","comments":true,"path":"2020/tonyhawkproskater12/","link":"","permalink":"https://barnyak.com/2020/tonyhawkproskater12/","excerpt":"","text":"Game: Tony Hawk Pro Skater 1+2 Let me start by stating what I’m sure you’ve already heard. If you liked the originals then you’re in for a treat. This is a really solid remake. It hit every beat I wanted it to. I cherished the originals like I’m sure some of you did. They really nailed the feeling of scraping together these crazy combos that spawn the map clearing cartoonish obstacles and hunting down that last bell that seems to escape you right at the last second. All with the punk music you’d expect perfectly merged with the crisp atmospheric sounds of a skateboard wheel carving through pavement and slapping down on a rail after hitting some random flip trick. There’s a nice skate shop, with not as much customization as I was hoping for, but just enough to get by. The stat system was a fun progression. But similar to the originals once you’ve maxed out the 4 primary stats you use it’s all set. I’m sure there’s some interesting setups revolving around the 700 some pro skater specific challenges. But by and large if you stick to a custom character you won’t be shocked by anything you find in that department. It really feels like a fresh render, new shaders and the necessary modern QOL changes you’d expect. All slapped on a truly fantastic base game. For those of you who won’t be just riding a nostalgia high it’s still a purchase recommendation from me. But here’s the short of it. What You’ll Like $40 AA price point Tricky but rewarding combo-based game play A healthy mix of hidden content the game pushes you towards finding Very fun well crafted tunes User made custom maps A mix of modern skate brands and classics (I’m looking at you Element) you’ll appreciate. What You Won’t Like If you’re not interested in the extra challenges you can blow through most of the maps Can get repetitive It doesn’t really get that much more difficult In SummaryIf you have any shred of a desire to play a skateboarding game. This one is worth it. Even at full price.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"The Future of Wireless Power","slug":"teslapower","date":"2020-09-09T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/teslapower/","link":"","permalink":"https://barnyak.com/2020/teslapower/","excerpt":"","text":"Topic: Nikola Tesla Riding on the back of Nikola Tesla through our modern history Emrod is going to move forward with a plan to test out “Wireless” power distribution in a commercial setting. 120 years later Tesla is finally getting his dream. Emrod, founded by Greg Kushnir, can move power between 2 static, predefined locations. While claiming that: There’s no radiation around the beam Atmospheric conditions should pose no interference (Atleast that would effect power distribution) A “low power laser safety curtain” that cuts power when a drone, bird or other object is about to cross into the power beam They purpose a really cool use-case for this power, which is distributing trucks to locations where portable power will be necessary. They call it “MOR” or Mobile Outage Response. The thought of power going down and your local power company simply driving a truck past the disruption to then tether into the grid is certainly Sci-Fi. You can checkout there other purposed services for wireless power Here “We have an abundance of clean hydro, solar, and wind energy available around the world but there are costly challenges that come with delivering that energy using traditional methods, for example, offshore wind farms or the Cook Strait here in New Zealand requiring underwater cables which are expensive to install and maintain&quot; Greg Kushnir","categories":[{"name":"tech","slug":"tech","permalink":"https://barnyak.com/categories/tech/"}],"tags":[]},{"title":"Next Generation Console Guide (Updated)","slug":"9_5_2020_nextgen","date":"2020-09-08T04:00:00.000Z","updated":"2020-09-11T20:36:52.620Z","comments":true,"path":"2020/9_5_2020_nextgen/","link":"","permalink":"https://barnyak.com/2020/9_5_2020_nextgen/","excerpt":"","text":"Here’s the short version of everything you need to know about “The Next Generation” of gaming consoles. Both sport fairly decent hardware improvements, ssd’s and 8k support. Plus backwards compatibility! Which is a huge win. Release Date(both): Holiday 2020Sony PlayStation 5 3D sound Dynamic Resistance Trigger (Haptic Feedback on the Triggers) Xbox Series X Quick Resume Split Motherboard for Cooling SSD Storage Expansion Port Shared New Features SSD 8k and 120hz 4K Backwards Compatible with Older Games Huge leaps in Hardware Performance 4K BluRay Smaller and cheaper digital versions. Both still flaunting 4K at 120FPS. PlayStation 5 Launch Titles Returnal Sackboy A Big Adventure Demon’s Souls Destruction AllStars Xbox Series X Launch Titles Halo Avowed Ever Wild Dark Tide Scarlet Nexus Update: 9/8/2020 an Xbox digital version has now been announced. It’s priced very well at $300 USD.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Raft Review","slug":"9_7_2020_raft","date":"2020-09-07T04:00:00.000Z","updated":"2020-09-11T20:36:56.260Z","comments":true,"path":"2020/9_7_2020_raft/","link":"","permalink":"https://barnyak.com/2020/9_7_2020_raft/","excerpt":"","text":"Game: RaftRaft is an early access game that was released on May 23, 2018. Developed as a student project at Uppsala University you can find the original student work on ItchIO Primarily it’s a sandbox exploration game where the principle mechanic is that you’re stuck on a raft. In an assumedly landless world. You then throw a hook out into the sea and snag some trash. Which you slowly use to work through the crafting tiers that you’d expect in a classic survival/exploration title. Sprinkled with some interesting island exploration early on. All in all I’m sure raft was a perfectly good title a couple months after launch, but 2 years later $40 for 10 hours of content is a tough sell. We worked through the campaign fairly quickly once it was the focus. And the upgrade tiers where practically non existent for some items. But it’s not all bad. The decorative recipes you did have access to where themed fairly well, allowing you to make very on-style ships for the game’s aesthetic. Eventually introducing the campaign in an explorative way was a good touch as well. And there was some early tech climbing excitement that I’m always on the lookout for. I’m conflicted in my recommendation of this game because the content that was there was actually pretty good. It just ran out in an unreasonably short amount of time. But either way check out our cool ship! What You’ll Like Build your own functional ship Gather mats and slowly discover new recipes It’s quite pretty. There’s a lack of good pirate and sea based titles right now. Cosmetics are pretty good, on theme, and reasonable to get (Talking about themed boat tiles here) What You Won’t Like Very limited story content Seems like you immediately hit the final tier Not much drive to keep playing the game after only 2 or 3 sessions. This all really comes down to the fact that it’s a 2018 title with Early Release Launch-esque content. Publisher Listed Features Multiplayer! Survive by yourself or with friends in online co-op! Hook! Use your hook to catch debris floating by. Craft! Build survival equipment, weapons, crop plots and more to help you stay alive! Build! Expand your raft from a simple wreckage to a buoyant mansion. Dive! Drop anchor and explore the depths for more resources. Fight! Defend your raft from the dangers of the ocean. In SummaryRaft is a solid 2-3 night experience with your friends. It lacks depth, but what’s there is pretty fun. I would buy it if it’s on sale.","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Dragon Age 4 Teaser Trailer","slug":"9_4_2020_dragonage4teaser","date":"2020-09-04T04:00:00.000Z","updated":"2020-09-11T20:36:52.620Z","comments":true,"path":"2020/9_4_2020_dragonage4teaser/","link":"","permalink":"https://barnyak.com/2020/9_4_2020_dragonage4teaser/","excerpt":"","text":"Game: Dragon Age 4","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"Planet 9 May be Smoking Gun For 2 Stars in Our Solary System","slug":"9_2_2020_planet92stars","date":"2020-09-02T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/9_2_2020_planet92stars/","link":"","permalink":"https://barnyak.com/2020/9_2_2020_planet92stars/","excerpt":"","text":"Topic: Planet Nine Interesting work done by Amir Siraj and Abraham Loeb is showing that the existence of Planet 9 is some of our strongest physical evidence for our solar system having 2 stars early in it’s development. We have not actually seen Planet 9 yet. But some gravitational feature’s of our solar system seem to imply it’s existence. In a fun twist more evidence of Planet 9 could be the smoking gun we need for a duo star development history for our own solar system. For reference here’s the orbit of “Sedna” which is a crazy cold, very far out, elongated orbiting object. Sedna’s strange orbit is one of the primary pieces of evidence that a large ninth planet must exist to have put it in such an orbit.","categories":[{"name":"space","slug":"space","permalink":"https://barnyak.com/categories/space/"}],"tags":[]},{"title":"Cyberpunk 2077 - GeForce RTX Trailer","slug":"9_1_2020_cyberpunkrtx","date":"2020-09-01T04:00:00.000Z","updated":"2020-09-11T20:36:43.900Z","comments":true,"path":"2020/9_1_2020_cyberpunkrtx/","link":"","permalink":"https://barnyak.com/2020/9_1_2020_cyberpunkrtx/","excerpt":"","text":"Game: Cyberpunk 2077","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"NASA Selects Robyn Gatens as Acting Director of ISS","slug":"8_31_2020_robyngatens","date":"2020-08-31T04:00:00.000Z","updated":"2020-09-25T22:52:57.390Z","comments":true,"path":"2020/8_31_2020_robyngatens/","link":"","permalink":"https://barnyak.com/2020/8_31_2020_robyngatens/","excerpt":"","text":"Topic: International Space StationThe International Space Station at NASA Headquarters has a new director! Robyn Gatens. She first started working for NASA in 1985 at the Marshall Space Flight Center and has since managed primarily environmental control and life support systems for human spaceflight missions. Robyn Gatens – Credit: NASA Also the recipient of NASA’s Outstanding Leadership and Exceptional Achievement Medals her resume is a perfect fit for the role and I’m very excited to see where she takes the ISS in the coming years. We’re only 62 days out from the 20th anniversary of manned operation at the International Space Station. So this is a perfect time to pass the mantle on to a champion of manned space flight and propel the ISS into another era.","categories":[{"name":"space","slug":"space","permalink":"https://barnyak.com/categories/space/"}],"tags":[]},{"title":"Transient (updates from gamescom 2020)","slug":"8_30_2020_transient","date":"2020-08-30T04:00:00.000Z","updated":"2020-09-11T20:36:39.500Z","comments":true,"path":"2020/8_30_2020_transient/","link":"","permalink":"https://barnyak.com/2020/8_30_2020_transient/","excerpt":"","text":"Game: Transient Transient (Iceberg Games) constantly refers to itself as cyberpunk meets H.P. Lovecraft. And that does seem to fit the bill with the demo, screenshots and trailers they’ve released so far. It’s using Unreal Engine 4 so you can safely assume the camera control polish and soft vibrant post processing that usually comes with that. But beyond that I haven’t play’d the demo yet myself. To know why i’m posting it though, just check out the trailer: The music seems solid. Aesthetic is a double-whammy and as long as the combat is solid and there’s an interesting story this seems like an obvious pick. The cyber-punk rally from cyberpunk 2077 may finally be starting to pay off!","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]},{"title":"World of Warcraft Shadowlands Release Date Announced","slug":"8_29_2020_shadowlands","date":"2020-08-29T04:00:00.000Z","updated":"2020-09-11T20:36:36.730Z","comments":true,"path":"2020/8_29_2020_shadowlands/","link":"","permalink":"https://barnyak.com/2020/8_29_2020_shadowlands/","excerpt":"","text":"Game: World of Warcraft The World of Warcraft Shadowlands Release Date has been announced! Official Release Date: October 27thHere’s the standout features of this expansion: Explore Warcraft’s Afterlife—Discover the wonders and horrors that await in the world beyond the veil. Ride across the gleaming fields of Bastion, lose yourself among the gothic spires of Revendreth, find yourself at the crossroads of fate in the eternal city of Oribos, and much more. Pledge Yourself to a Covenant—Align with one of the Shadowlands’ four Covenants, each with unique story campaigns, gameplay features, and powers that they bestow upon those who pledge themselves to their cause. Choose between Bastion’s valiant Kyrian or Revendreth’s prideful Venthyr, fight for the mighty Necrolords of Maldraxxus, or seek renewal with the wild Night Fae of Ardenweald. Ascend the Tower of the Damned—The vilest souls in existence are locked away in Torghast, an otherworldly prison ruled by the terrifying entity known as the Jailer. This ever-changing, roguelike challenge is open to solo players and groups of up to five, and those who brave its trials will earn materials to commission rune-carved legendary equipment of their choosing. Rise as a Death Knight—Bolvar Fordragon, the former paladin who once wore the helm of the Lich King to keep the Scourge at bay, seeks to bolster the Death Knights’ numbers—now, all Allied Races as well as pandaren can join their unholy ranks. (Available with pre-purchase.) And More. . .—Endure the Jailer’s watchful eye in the Maw, where the challenge mounts the longer you linger; Soulbind with key characters of your chosen Covenant to share their distinct powers; choose how to restore your Covenant’s Sanctum to glory . . . Shadowlands is unlike anything ever before experienced in World of Warcraft. Sounds like it’s about time to get back to Azeroth!!","categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"}],"tags":[]}],"categories":[{"name":"games","slug":"games","permalink":"https://barnyak.com/categories/games/"},{"name":"tech","slug":"tech","permalink":"https://barnyak.com/categories/tech/"},{"name":"space","slug":"space","permalink":"https://barnyak.com/categories/space/"}],"tags":[]}